lecture_3/app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    @page = Page.find(params[:id])

INSERT INTO "pages" ("created_at", "title", "updated_at", "copy") VALUES('2010-09-20 14:21:45', 'Test Page', '2010-09-20 14:21:45', '<p>This is a page</p>')
---
  def create
    @page = Page.new(params[:page])
    @page.save!

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 3)
UPDATE "pages" SET "updated_at" = '2010-09-21 06:22:36', "copy" = '<p>New Page</p>' WHERE "id" = 3
---
  def update
    @page = Page.find(params[:id])
    @page.attributes = params[:page]
    @page.save!

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def delete
    @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
DELETE FROM "pages" WHERE "id" = 1
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy